import React from "react";
import "./aboutPage.scss";

// assets
import pImg from "../../assets/images/mah-2.png";

// components
import NewsSection from "../../cpmponents-ui/newsSection/NewsSection";
import SupportInfoSection from "../../cpmponents-ui/supportInfoSection/SupportInfoSection";

const AboutPage = () => {
  return (
    <div className="aboutPage">
      <div className="wrapper about_container">
        <div className="wrapper_layout content">
          <div className="header">
            <span>আমার সম্পর্কে</span>
            <h2>শিক্ষা, ন্যায় ও উন্নয়নের পথে এক প্রতিশ্রুতিশীল নেতৃত্ব</h2>
            <p>
              অধ্যক্ষ মাহবুবুল আলম একজন শিক্ষাবিদ, সমাজসংগঠক ও জননেতা দীর্ঘদিন
              ধরে তিনি শিক্ষা ও মানবকল্যাণের উন্নয়নে কাজ করে যাচ্ছেন তার
              নেতৃত্বের লক্ষ্য — একটি ন্যায্য, সমৃদ্ধ ও সচেতন সমাজ গঠন, যেখানে
              প্রত্যেক মানুষ মর্যাদা ও সুযোগের সমান অধিকার ভোগ করবে।
            </p>
          </div>

          <div className="content_container">
            <div className="left_content">
              <span>
                ডা. শফিকুর রহমান বাংলাদেশের রাজনীতির ইতিহাসে এক অনন্য নাম। এদেশে
                ইসলাম প্রতিষ্ঠায় যারা গুরুত্বপূর্ণ ভূমিকা রেখেছেন তাদের মধ্যে
                বাংলাদেশ জামায়াতে ইসলামীর আমীর ডা. শফিকুর রহমান অন্যতম।
                ব্যক্তিগত, পারিবারিক, পেশাগত ও জাতীয় রাজনৈতিক জীবনে তিনি সততা,
                যোগ্যতা, মেধার স্বাক্ষর রেখে চলেছেন। দেশের প্রতিটি গণতান্ত্রিক
                আন্দোলন ও গণমানুষের অধিকার প্রতিষ্ঠায় তিনি অগ্রণী ভূমিকা পালন
                করে যাচ্ছেন।
              </span>

              <span>
                জন্ম : <br /> জাতির এই সাহসী সন্তান ও প্রতিভাবান রাজনীতিবিদ ১৯৫৮
                সালের ৩১ অক্টোবর মৌলভীবাজার জেলার কুলাউড়া থানার এক সম্ভ্রান্ত
                মুসলিম পরিবারে জন্মগ্রহণ করেন। তার পিতার নাম মোহাম্মদ আবরু মিয়া
                এবং মাতার নাম খাতিরুন নেছা। শফিকুর রহমানেরা তিন ভাই ও এক বোন।
                ভাই-বোনদের মধ্যে তিনি তৃতীয়।
              </span>

              <span>
                শিক্ষা ও ক্যারিয়ার : <br /> ডা. শফিকুর রহমান ১৯৭৪ সালে স্থানীয়
                বরমচাল উচ্চ বিদ্যালয় থেকে এস এস সি এবং ১৯৭৬ সালে সিলেট এম সি
                কলেজ থেকে কৃতিত্বের সাথে এইচ এস সি পরীক্ষায় উত্তীর্ণ হন। তিনি
                ১৯৮৩ সালে সিলেট মেডিকেল কলেজ (বর্তমান এম এ জি ওসমানী মেডিক্যাল
                কলেজ) থেকে এমবিবিএস ডিগ্রী অর্জনের পর চিকিৎসা সেবার পাশাপাশি
                রাজনীতিতে আত্মনিয়োগ করেন।
              </span>

              <span>
                রাজনৈতিক জীবন : <br />
                বর্ণাঢ্য রাজনৈতিক জীবনের অধিকারী ডাঃ শফিকুর রহমান জাসদ
                ছাত্রলীগের মাধ্যমে ছাত্র রাজনীতিতে সম্পৃক্ত হন। ১৯৭৩ সালে জাসদ
                ছাত্রলীগে যোগদান করেন। ১৯৭৭ সালে দ্বীন প্রতিষ্ঠার প্রত্যয়দীপ্ত
                কাফেলা বাংলাদেশ ইসলামী ছাত্রশিবিরে যোগদান করেন। পরবর্তিতে এই
                সংগঠনের সিলেট মেডিকেল কলেজ শাখার সভাপতি এবং সিলেট শহর শাখার
                সভাপতির দয়িত্ব পালন করেন।
              </span>

              <span>
                ১৯৮৪ সালে জামায়াতে ইসলামীতে যোগদানের মাধ্যমে তিনি বৃহত্তর
                রাজনীতিতে পদার্পন করেন। এরপর সিলেট শহর, জেলা ও মহানগরী আমীর
                হিসেবে দায়িত্ব পালন করেন। ২০১৬ সালে জামায়াতের সেক্রেটারী জেনারেল
                হিসেবে নিযুক্ত হয়ে সফলতার সাথে দায়িত্ব পালন করে যাচ্ছেন। ২০১৯
                সালের ১২ নভেম্বর জামায়াতে ইসলামীর রুকনগণের (সদস্য) প্রত্যক্ষ
                ভোটের মাধ্যমে আমীর নির্বাচিত হন এবং ২০১৯ সালের ৫ ডিসেম্বর
                ২০২০-২০২২ কার্যকালের জন্য তিনি আমীরে জামায়াত হিসেবে শপথ গ্রহণ
                করেন।
              </span>
            </div>

            <div className="right_content">
              <img src={pImg} alt="" />

              <div className="info">
                <h2>মাহবুবুল আলম</h2>

                <span>
                  অধ্যক্ষ, আল হেলাল ইসলামী একাডেমী এন্ড কলেজ, সাপাহার।
                </span>
              </div>

              <div className="info_section">
                <h3>রাজনৈতিক পরিচয় </h3>

                <div className="item">
                  <span>কর্মপরিষদ সদস্য </span>

                  <p>বাংলাদেশ জামায়াতে ইসলামী, নওগাঁ জেলা শাখা।</p>
                </div>
                <div className="item">
                  <span>সাবেক সদস্য </span>

                  <p>বাংলাদেশ ইসলামী ছাত্রশিবির।</p>
                </div>
              </div>

              <div className="info_section">
                <h3>অন্যান্য</h3>

                <div className="item">
                  <span>উপদেষ্টা </span>
                  <p>স্বেচ্ছাসেবী সংগঠন মাঊন ক্লাব। </p>
                </div>
                <div className="item">
                  <span>সাবেক কমিশনার </span>
                  <p>বাংলাদেশ স্কাউট, সাপাহার উপজেলা শাখা। </p>
                </div>

                <div className="item">
                  <span>সভাপতি</span>
                  <p>বাংলাদেশ আদর্শ শিক্ষক ফেডারেশন, নওগাঁ জেলা শাখা।</p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>

      <NewsSection />
      <SupportInfoSection contentPadding={true} />
    </div>
  );
};

export default AboutPage;
