export const footerData = {
  name: "মাহবুবুল আলম",
  desc: "আমাদের লক্ষ্য ও উদ্দেশ্য হল সবচেয়ে উত্তম উৎস থেকে বিশুদ্ধ হাদীস সকলের জন্য উন্মুক্ত করে দেয়া। আমরা এই ওয়েবসাইটটি সর্বাধিক গুরুত্বের সাথে তৈরি করেছি যাতে যে কেউ সহজেই হাদিস শিখতে ও শিখাতে পারে। আমরা আপনাদের একান্ত সহযোগিতা চাই এই ওয়েবসাইটটি সহ আমাদের পুরো প্রজেক্টের পরিসর বাড়িয়ে এগিয়ে যেতে। আমাদের একটি মোবাইল অ্যাপ রয়েছে যাতে আপনি যেকোনো স্থানে যেকোন সময় স্বাচ্ছন্দ্যে হাদীস পড়তে পারেন।",

  menu: [
    {
      title: "নেভিগেট",
      list: [
        {
          name: "হোম",
          link: "/",
        },
        {
          name: "আমার সম্পর্কে",
          link: "/about",
        },
        {
          name: "সংবাদ/কার্যক্রম ",
          link: "/news",
        },
      ],
    },
    {
      title: "সার্বিক সহযোগিতা ",
      list: [
        {
          name: "স্বেচ্ছাসেবক হোন",
          link: "/",
        },
        {
          name: "সাপোর্ট করুন ",
          link: "/support",
        },
      ],
    },
    {
      title: "জনপ্রিয় সাইটসমূহ",
      list: [
        {
          name: "বাংলাদেশ জামায়াতে ইসলামী",
          link: "/",
        },
        {
          name: "বাংলাদেশ ইসলামী ছাত্রশিবির",
          link: "/",
        },
      ],
    },
  ],
};
